{"pageProps":{"frontmatter":{"title":"Aftercare Tips for Dental Extraction or Wisdom Tooth Extraction","author":"Dr. Achla Verma","date":"May 7, 2023","excerpt":"Post Dental Surgery tips & Precautions","cover_image":"/assets/blog/extraction.jpeg","keywords":"dental extraction,wisdom tooth extraction, care post dental extraction, dental surgery,teeth extraction near me gurgaon, impaction, dental care","description":"After any surgical procedure or any injury whether intentional or unintentional in body will lead to inflammation in body to help in faster healing of surgical site/injury which is a normal phenomena, Similarly in oral cavity too after dental extraction or dental surgery the nerve endings and bone are open source for normal bacterial flora of our mouth to enter into systemic supply even after suture. So, a proper tooth removal aftercare is very essential for smooth healing of dental extraction or Dental surgical site. The strict guidelines advised to be followed for comfortable healing after tooth removal.."},"slug":"aftercare-tips-for-dental-extraction","content":"## Why we need to take Precaution after dental surgery/dental extraction?\n\nAfter any surgical procedure or any injury whether intentional or unintentional in body will lead to inflammation in body to help in faster healing of surgical site/injury which is a normal phenomena, Similarly in oral cavity too after dental extraction or dental surgery the nerve endings and bone are open source for normal bacterial flora of our mouth to enter into systemic supply even after suture. **So, a proper tooth removal aftercare is very essential for smooth healing of dental extraction or Dental surgical site.** The strict guidelines advised to be followed for comfortable healing after tooth removal.. \n\nSo the question that comes to mind is what to do after tooth extraction, Here are some precautions after tooth extraction which must be followed to minimize the pain and it will surely make the healing comfortable for you. \n\n1. The **Cotton gauge piece** should be there in your surgical site for **at least for 45 Minutes - 1 hour** as it will help in compression of blood oozing from the surgery site.\n2. After throwing that gauge piece one should eat **A cup of ice-cream** it will help in stopping the bleeding from the surgical site (Do not have stick ice-cream or popsicle). \n![\"Ice Cream Cup\"](/assets/blog/ice_cream.webp \"Ice Cream Cup\")\n3. Patient is advised **not to eat from the surgical site** for the next few days.\n4. Patients are advised to **swallow the saliva inside for next 24 hrs after surgery**, kindly do not spit the saliva as it can increase chance of bleeding and delayed healing of surgical site.\n5. Patients are **advised to eat a soft diet like Daliya, Dal-rice, khichdi, Oats, Poha, Upma, Eggs etc.**, which should not be spicy and Hot it should be at room temperature.\n6. Post extraction/surgery patients are advised to do warm saline rinses for next 7-10 Days for better healing.\n7. Food that must be avoided- **do not eat ice-cream with a stick, No to cold-drinks, No to Spicy and hot food, No to hard food at least for 5-7 days.**\n8. **Medicinal instructions must be followed as per given by your dentist** along with other oral mouth rinses as per procedure done.\n9. Do **visit your doctor/dentist for suture removal or for follow-up visit** for proper assurance in healing of surgical/extraction site. \n![\"Sutures Post Extraction\"](/assets/blog/sutures_post_extraction.webp \"Sutures Post extraction\")\n10. You can book an [appointment](/appointment) with **Hapliv Dental Clinic** for any dental related problem.\n11. In Case of any facial Swelling patients are advised to do Cold pack on the face (Do not put your hand on the face/hot bath/Do not sleep from the surgical site towards your pillow as it can increase inflammation hence swelling on the face).\n12. Patients are advised not to brush on surgical site/dental extraction site as it can hamper healing but patients should maintain oral hygiene by following above instructions.\n13. Patients are advised **not to smoke cigarettes or drink alcohol** for next 8-10 Days. As these habits slow down the healing process and may lead to pain and discomfort in the post extraction phase.","recommendation":[{"slug":"dental-health-important-for-happy-living","frontmatter":{"title":"Dental health: Important for happy living","author":"Dr. Achla Verma","date":"Feb 10, 2023","excerpt":"Dental Health and awareness","cover_image":"/assets/blog/toothbrush_toothpaste_hygiene.webp","keywords":"dental health, dental awareness, happy living, healthy dental, oral health and awareness, gums, cavities, bad breath, tooth decay, pain","description":"Good dental health is essential for overall well-being, and it's important to take care of your teeth and gums. Poor oral hygiene can lead to a variety of problems, including cavities, gum disease, bad breath and tooth decay."}},{"slug":"what-is-root-canal-treatment-and-how-much-it-costs","frontmatter":{"title":"What is Root Canal Treatment (RCT) and its cost in Gurgaon?","author":"Dr. Praveen Raghav","date":"May 14, 2023","excerpt":"Toothache and cavity treatment by Root Canal Treatment","cover_image":"/assets/blog/root-canal-dental-model.webp","keywords":"root canal treatement,painless rct,tooth decay,caries,tooth loss,dental pain relieve,endodontist,dr praveen raghav, dr achla verma, dental clinic near you,sector 65, gurgaon, M3M Tee point","description":"Root canal treatment is a dental procedure that aims to save a tooth that is infected or damaged due caries/wear tear of tooth because of bad bite. It is done by removing the pulp (the soft tissue inside the tooth that contains nerves and blood vessels) and filling and sealing the space left behind. Root canal treatment can prevent tooth loss, relieve pain and restore the function and appearance of the tooth."}},{"slug":"yellow-to-white-teeth-whitening-procedure","frontmatter":{"title":"Yellow to White teeth: Teeth Whitening Procedure","author":"Dr. Achla Verma","date":"May 12, 2023","excerpt":"Benefits and Risks of Teeth whitening procedure","cover_image":"/assets/blog/teeth_whitening.webp","keywords":"teeth whitening,yellow to white teeth,laser teeth whitening, teeth stains, whitening toothpaste, benefits teeth whitening, dr. achla verma, sector 65, gurgaon,clinic in gurgaon,M3M Tee point","description":"If you want to have a brighter smile, you might be interested in teeth whitening. Teeth whitening is a cosmetic procedure that aims to make your natural teeth look brighter by reducing stains and discoloration. There are different types of teeth whitening methods, and some of them can be done at home or at your dentist's office. In this blog post, we will explain what teeth whitening is, how it works, and what are the benefits and risks of this procedure."}},{"slug":"when-should-i-take-my-child-to-orthodontist","frontmatter":{"title":"When should I take my child to the Braces Specialist (Orthodontist)?","author":"Dr. Achla Verma","date":"May 9, 2023","excerpt":"Bad dental habits effects on child jaw development","cover_image":"/assets/blog/close-up-little-girl-having-her-teeth-examined-by-dentist.webp","keywords":"dental clinic, crooked teeth, dentist, deepbite, underbite, orthodontist, braces, children, adolescent age,tongue thrusting,thumb sucking,mouth breathing,braces specialists, sector 65, gurgaon,clinic in gurgaon,M3M Tee point","description":"While we think at the age of 7-8 years our child is too young for braces treatment, the most children have a mix of baby and permanent teeth our orthodontists can spot even small issues with your child’s bite and teeth alignment before they turn into any major problem, that might even need surgery if not treated at correct age."}},{"slug":"invisalign-aligners-a-clear-choice-over-traditional-braces","frontmatter":{"title":"Invisalign Aligners: A Clear Choice over Traditional Braces","author":"Dr. Achla Verma","date":"Jun 20, 2023","excerpt":"Invisible Orthodontics","cover_image":"/assets/blog/girl-showing-invisalign.webp","keywords":"Invisalign Aligners, Traditional Braces, Aesthetics, Discretion, Comfort, Convenience, Improved Oral Hygiene, Fewer Orthodontic Visits, Predictable Results, Faster Results, 3D Computer Imaging, Treatment Plan Visualization, Conclusion","description":"Let's explore why Invisalign aligners are considered better than braces for achieving a straight smile"}},{"slug":"what-is-laser-teeth-whitening","frontmatter":{"title":"What is Laser Teeth Whitening and How Does it Work?","author":"Dr. Achla Verma","date":"May 14, 2023","excerpt":"Teeth whitening using LASER technology","cover_image":"/assets/blog/laser-teeth-whitening.webp","keywords":"Laser teeth whitening,Teeth whitening treatment,Cosmetic dentistry,Brighter smile,Dental lasers,Bleaching,Stain removal,Tooth discoloration,Professional whitening,Zoom whitening,In-office whitening,Safe whitening,Painless whitening,Quick whitening,Advanced whitening","description":"Everyone wants a beautiful and bright smile, and one of the easiest ways to achieve this is through teeth whitening. While there are several methods of teeth whitening available, one of the most popular options is laser teeth whitening. In this blog post, we'll explore what laser teeth whitening is, how it works, and what you can expect from the procedure."}}]},"__N_SSG":true}